CSI API ETABS v1
cStory.GetStories_2 Method
 Retrieves the story information for the current tower.
 This function supersedes GetStories
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetStories_2(
	ref double BaseElevation,
	ref int NumberStories,
	ref string[] StoryNames,
	ref double[] StoryElevations,
	ref double[] StoryHeights,
	ref bool[] IsMasterStory,
	ref string[] SimilarToStory,
	ref bool[] SpliceAbove,
	ref double[] SpliceHeight,
	ref int[] color
)
Function GetStories_2 (
	ByRef BaseElevation As Double,
	ByRef NumberStories As Integer,
	ByRef StoryNames As String(),
	ByRef StoryElevations As Double(),
	ByRef StoryHeights As Double(),
	ByRef IsMasterStory As Boolean(),
	ByRef SimilarToStory As String(),
	ByRef SpliceAbove As Boolean(),
	ByRef SpliceHeight As Double(),
	ByRef color As Integer()
) As Integer
Dim instance As cStory
Dim BaseElevation As Double
Dim NumberStories As Integer
Dim StoryNames As String()
Dim StoryElevations As Double()
Dim StoryHeights As Double()
Dim IsMasterStory As Boolean()
Dim SimilarToStory As String()
Dim SpliceAbove As Boolean()
Dim SpliceHeight As Double()
Dim color As Integer()
Dim returnValue As Integer
returnValue = instance.GetStories_2(BaseElevation,
	NumberStories, StoryNames, StoryElevations,
	StoryHeights, IsMasterStory, SimilarToStory,
	SpliceAbove, SpliceHeight, color)
int GetStories_2(
	double% BaseElevation,
	int% NumberStories,
	array<String^>^% StoryNames,
	array<double>^% StoryElevations,
	array<double>^% StoryHeights,
	array<bool>^% IsMasterStory,
	array<String^>^% SimilarToStory,
	array<bool>^% SpliceAbove,
	array<double>^% SpliceHeight,
	array<int>^% color
)
abstract GetStories_2 :
        BaseElevation : float byref *
        NumberStories : int byref *
        StoryNames : string[] byref *
        StoryElevations : float[] byref *
        StoryHeights : float[] byref *
        IsMasterStory : bool[] byref *
        SimilarToStory : string[] byref *
        SpliceAbove : bool[] byref *
        SpliceHeight : float[] byref *
        color : int[] byref -> int
Parameters
BaseElevation
Type: System.Double
 The elevation of the base [L]
NumberStories
Type: System.Int32
 The number of stories
StoryNames
Type: System.String[]
 The names of the stories
StoryElevations
Type: System.Double[]
 The story elevations [L]
StoryHeights
Type: System.Double[]
 The story heights [L]
IsMasterStory
Type: System.Boolean[]
 Whether the story is a master story
SimilarToStory
Type: System.String[]
 If the story is not a master story, which master story the story is similar to
SpliceAbove
Type: System.Boolean[]
 This is True if the story has a splice height, and False otherwise
SpliceHeight
Type: System.Double[]
 The story splice height [L]
color
Type: System.Int32[]
 The display color for the story specified as an Integer
Return Value
Type: Int32
 Returns zero if the story data is successfully retrieved, otherwise returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim BaseElevation As Double
       Dim NumberStories As Integer
       Dim StoryNames() As String
       Dim StoryElevations() As Double
       Dim StoryHeights() As Double
       Dim IsMasterStory() As Boolean
       Dim SimilarToStory() As String
       Dim SpliceAbove() As Boolean
       Dim SpliceHeight() As Double
       Dim color As Integer()
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get stories
       ret = SapModel.Story.GetStories_2(BaseElevation, NumberStories, StoryNames, StoryElevations,
                                         StoryHeights, IsMasterStory, SimilarToStory, SpliceAbove, SpliceHeight, color)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cStory Interface
ETABSv1 Namespace